// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите цифровое обозначение дня недели");
int day = Convert.ToInt32(Console.ReadLine());

if (day >= 1 && day <= 5)
{ 
    Console.WriteLine("не выходной день");
}

else if (day >= 6 && day <= 7)
{ 
    Console.WriteLine("выходной день");
}

else 
{
    Console.Write("дней недели всего 7, введите число от 1 до 7");
}
